[
  {
    "id": 1,
    "name": "Wireless Earbuds Pro",
    "price": 1290.99,
    "image": "/images/earbuds.jpg",
    "description": "Discount️‍ 20%🔥.Active noise-cancelling, 30hr battery with case.",
    "information": "SoundMaster Pro wireless earbuds feature advanced hybrid active noise cancellation with 6 microphones for crystal clear calls. The ergonomic design provides all-day comfort with 4 included ear tip sizes. Enjoy seamless pairing with Bluetooth 5.2 and quick charging (5 hours playback from 15 minutes charge). Features touch controls, IPX5 water resistance, and customizable EQ through the companion app. Perfect for commuters, fitness enthusiasts, and audiophiles seeking premium sound quality.",
    "company": "SoundMaster",
    "warranty": "years:2",
    "category": "electronics",
    "rating": 4.5
  },
  {
    "id": 2,
    "name": "Flagship Smartphone",
    "price": 18999.99,
    "image": "/images/phone.jpg",
    "description": "Discount️‍ 20%🔥. 6.7\" OLED, 256GB storage, 5G capable.",
    "information": "The Nova X20 Pro features a stunning 6.7\" Dynamic AMOLED 2X display with 120Hz refresh rate and HDR10+ support. Powered by the latest Snapdragon 8 Gen 2 processor with 12GB RAM and 256GB UFS 4.0 storage. The triple camera system includes a 108MP main sensor with 8K video recording. Includes under-display fingerprint scanner, IP68 water resistance, and 5000mAh battery with 65W fast charging. Comes with Nova's OneUI 5 based on Android 13 with 4 years of OS updates guaranteed.",
    "company": "Nova",
    "warranty": "years:2",
    "category": "electronics",
    "rating": 4.8
  },
  {
    "id": 3,
    "name": "Ultrabook Laptop",
    "price": 40000.99,
    "image": "/images/laptop.jpg",
    "description": "14\" 4K display, 16GB RAM, 1TB SSD.",
    "information": "The TitanBook Pro 14 features a brilliant 14\" 4K IPS touchscreen with 100% DCI-P3 color accuracy. Equipped with Intel Core i9-13900H processor, 16GB LPDDR5 RAM, and 1TB PCIe 4.0 SSD. The magnesium alloy chassis weighs just 1.3kg while offering MIL-STD-810H durability. Includes Thunderbolt 4 ports, WiFi 6E, and a backlit keyboard. The 72Wh battery provides up to 12 hours of productivity. Comes pre-installed with Windows 11 Pro and includes Titan's premium support package.",
    "company": "Titan",
    "warranty": "years:2",
    "category": "electronics",
    "rating": 4.7
  },
  {
    "id": 4,
    "name": "4K Smart TV",
    "price": 10999.99,
    "image": "/images/tv.jpg",
    "description": "55-inch 4K UHD Smart TV with HDR",
    "information": "The VisionPlus QLED55 features a 55\" Quantum Dot display with 4K resolution, HDR10+, and 120Hz refresh rate. Powered by the Cognitive Processor XR for superior upscaling and image processing. The Android TV platform includes built-in Google Assistant and Chromecast with access to thousands of apps. Features HDMI 2.1 ports for gaming (VRR/ALLM supported), Dolby Vision/Atmos, and a 60W 2.1 channel speaker system. The ultra-thin bezel design comes with a premium metal stand.",
    "company": "VisionPlus",
    "warranty": "years:2 panel warranty",
    "category": "electronics",
    "rating": 4.6
  },
  {
    "id": 5,
    "name": "Gaming Console",
    "price": 25499.99,
    "image": "/images/console.jpg",
    "description": "Next-gen gaming with 4K resolution",
    "information": "The GameSphere X features a custom AMD Zen 2 processor and RDNA 2 graphics delivering true 4K gaming at 120fps. Includes 1TB ultra-high speed SSD with hardware decompression for near instant load times. The DualSense Pro controller offers haptic feedback, adaptive triggers, and improved ergonomics. Backward compatible with thousands of GameSphere 4 titles. Comes bundled with one exclusive AAA title of your choice. Supports ray tracing, 3D audio, and 8K output for future-ready gaming.",
    "company": "GameSphere",
    "warranty": "years:2",
    "category": "electronics",
    "rating": 4.9
  },
  {
    "id": 6,
    "name": "Smart tracker",
    "price": 5249.99,
    "image": "/images/smartracker.jpg",
    "description": "Fitness tracking with heart rate monitor",
    "information": "The HealthTrack Pro 5 features a 1.78\" always-on AMOLED display with 450nit brightness. Tracks heart rate, blood oxygen, stress, sleep, and over 100 workout modes. Includes built-in GPS, NFC payments, and 5ATM water resistance. The titanium case is lightweight yet durable with sapphire crystal glass. Battery lasts up to 14 days in smartwatch mode. Syncs with both Android and iOS devices. Includes advanced health metrics like ECG, skin temperature, and women's health tracking.",
    "company": "HealthTrack",
    "warranty": "years:2",
    "category": "electronics",
    "rating": 4.3
  },
  {
    "id": 7,
    "name": "Bluetooth Speaker",
    "price": 2089.99,
    "image": "/images/speaker.jpg",
    "description": "Portable waterproof Bluetooth speaker",
    "information": "The SoundBoom Xtreme delivers 360° sound with dual 30W drivers and passive radiators for deep bass. Features IP67 waterproof and dustproof rating, making it perfect for pool parties or beach trips. The rugged design includes a built-in carrying handle and rubberized exterior. Enjoy up to 24 hours of playtime at moderate volume. Includes PartyBoost to pair multiple speakers, built-in mic for calls, and USB-C charging. The speaker floats in water and can withstand drops from 1 meter.",
    "company": "SoundBoom",
    "warranty": "years:1",
    "category": "electronics",
    "rating": 4.4
  },
  {
    "id": 8,
    "name": "DSLR Camera",
    "price": 6799.99,
    "image": "/images/camera.jpg",
    "description": "24MP DSLR camera with kit lens",
    "information": "The FotoMaster EOS R50 features a 24.1MP full-frame CMOS sensor with DIGIC X image processor. Includes RF 24-105mm f/4L IS USM kit lens with Nano USM for fast, quiet autofocus. 4K 30p video with Canon Log support, dual pixel CMOS AF with eye detection. Features a vari-angle touchscreen LCD, weather-sealed magnesium alloy body, and 5-axis in-body stabilization. The optical viewfinder provides 100% coverage with 0.76x magnification. Includes WiFi, Bluetooth, and USB charging.",
    "company": "FotoMaster",
    "warranty": "years:2",
    "category": "electronics",
    "rating": 4.7
  },
  {
    "id": 9,
    "name": "Noise Cancelling Headphones",
    "price": 1349.99,
    "image": "/images/headphones.jpg",
    "description": "Premium over-ear noise cancelling",
    "information": "The QuietPro XM5 headphones feature industry-leading noise cancellation with 8 microphones analyzing ambient sound. The 40mm drivers deliver exceptional audio quality with LDAC support for high-resolution wireless. Enjoy up to 30 hours of battery life with quick charging (5 minutes = 5 hours). The plush memory foam earpads provide all-day comfort. Features touch controls, speak-to-chat technology, and multipoint Bluetooth connection. Comes with a premium hard carrying case and 3.5mm cable for wired use.",
    "company": "QuietPro",
    "warranty": "years:1",
    "category": "electronics",
    "rating": 4.8
  },
  {
    "id": 10,
    "name": "Tablet Pro",
    "price": 10449.99,
    "image": "/images/tablet.jpg",
    "description": "10.5-inch tablet with stylus support",
    "information": "The NovaTab S8 Ultra features a stunning 14.6\" 120Hz AMOLED display with S-Pen included. Powered by the Snapdragon 8 Gen 1 processor with 12GB RAM and 256GB storage (expandable). The ultra-thin 5.5mm design includes an under-display front camera. DeX mode transforms it into a desktop experience. Includes quad speakers tuned by AKG, WiFi 6E, and 11,200mAh battery. The Book Cover Keyboard is included, making it a perfect laptop replacement. Comes with 3 years of OS updates.",
    "company": "Nova",
    "warranty": "years:1",
    "category": "electronics",
    "rating": 4.5
  },
  {
    "id": 11,
    "name": "Wireless Keyboard",
    "price": 679.99,
    "image": "/images/keyboard.jpg",
    "description": "Ergonomic design, silent keys",
    "information": "The SwiftType K300 offers an ultra-slim design with soft, quiet scissor-switch keys for comfortable long-hour typing. Compatible with Windows, MacOS, and Linux systems via Bluetooth 5.1 or USB receiver. Features adjustable tilt legs, rechargeable battery lasting up to 3 months, and multi-device pairing with quick-switch keys. The spill-resistant design ensures durability in busy workspaces. Ideal for home offices and mobile setups, it includes customizable hotkeys and smart energy-saving mode.",
    "company": "SwiftType",
    "warranty": "years:2",
    "category": "electronics",
    "rating": 4.4
  },
  {
    "id": 12,
    "name": "Gaming Mouse",
    "price": 359.99,
    "image": "/images/mouse.jpg",
    "description": "RGB lighting, 16000 DPI",
    "information": "The HyperClaw V7 is equipped with a 16,000 DPI optical sensor for pinpoint accuracy and lightning-fast response. The ergonomic design fits comfortably in both claw and palm grips. Customizable RGB lighting syncs with your gaming setup via the HyperClaw software suite. Features 7 programmable buttons, onboard memory profiles, and ultra-durable Omron switches rated for 50 million clicks. Perfect for competitive gaming and creative workloads.",
    "company": "HyperClaw",
    "warranty": "years:2",
    "category": "electronics",
    "rating": 4.6
  },
  {
    "id": 13,
    "name": "External SSD",
    "price": 1129.99,
    "image": "/images/ssd.jpg",
    "description": "1TB portable SSD, USB-C",
    "information": "The SpeedVault X1 is a portable 1TB SSD offering lightning-fast read/write speeds up to 1050MB/s via USB 3.2 Gen 2 Type-C. Compatible with Windows, macOS, Android, and game consoles. Its shock-resistant, rugged aluminum casing protects your data on the move. Plug-and-play functionality ensures easy backups, while AES 256-bit hardware encryption safeguards sensitive files. Comes with a compact travel pouch and USB-C to A adapter for versatile connectivity.",
    "company": "SpeedVault",
    "warranty": "years:2",
    "category": "electronics",
    "rating": 4.7
  },
  {
    "id": 14,
    "name": "Action Camera",
    "price": 11299.99,
    "image": "/images/actioncam.jpg",
    "description": "4K video, waterproof case included",
    "information": "The XploreCam Ultra records stunning 4K60fps video and 20MP stills, perfect for adventure lovers. Features include HyperSmooth stabilization, timewarp, and horizon leveling for cinematic footage. Comes with a waterproof housing rated for depths up to 40 meters. Supports voice control, live streaming, and RAW image capture. Dual screens allow for easy framing whether you're front-facing or behind the lens. Compatible with a wide range of mounts and accessories.",
    "company": "XploreCam",
    "warranty": "years:2",
    "category": "electronics",
    "rating": 4.5
  },
  {
    "id": 15,
    "name": "E-Reader",
    "price": 8139.99,
    "image": "/images/ereader.jpg",
    "description": "Glare-free display, weeks of battery",
    "information": "The PageTurner S7 offers a 7 high-contrast e-ink Carta display with adjustable warm light for day and night reading. Waterproof IPX8-rated body allows safe poolside or bathtub use. Features a 300 PPI screen for paper-like sharpness, WiFi connectivity, and 8GB of internal storage for thousands of books. Supports ePub, PDF, MOBI, and more formats. Battery life lasts up to 6 weeks on a single charge.",
    "company": "PageTurner",
    "warranty": "years:1",
    "category": "electronics",
    "rating": 4.6
  },
  {
    "id": 16,
    "name": "Fitness Tracker",
    "price": 999.99,
    "image": "/images/tracker.jpg",
    "description": "Heart rate, sleep tracking, waterproof",
    "information": "The FitCore Band 6 provides all-day health monitoring, including heart rate, SpO2, and sleep analysis. Features 5ATM water resistance, 14-day battery life, and 120+ exercise modes with auto-detection. The 1.1 AMOLED display offers crisp visuals under direct sunlight. Supports smart notifications, music control, and camera shutter function. Syncs with both Android and iOS through the FitCore app for advanced analytics.",
    "company": "FitCore",
    "warranty": "years:1",
    "category": "electronics",
    "rating": 4.3
  },
  {
    "id": 17,
    "name": "Portable Projector",
    "price": 5349.99,
    "image": "/images/projector.jpg",
    "description": "1080p HD, built-in speaker",
    "information": "The BeamCast Mini projects sharp 1080p HD images up to 120 inches with vibrant colors and deep contrast. Features a built-in Hi-Fi speaker, HDMI and USB ports, and wireless screen mirroring via AirPlay and Miracast. Compact and lightweight design makes it ideal for both indoor movie nights and outdoor gatherings. Auto keystone correction and focus adjustment offer hassle-free setup in any space.",
    "company": "BeamCast",
    "warranty": "years:2",
    "category": "electronics",
    "rating": 4.4
  },
  {
    "id": 18,
    "name": "VR Headset",
    "price": 13399.99,
    "image": "/images/vr.jpg",
    "description": "Immersive virtual reality experience",
    "information": "The VirtuaView XR2 delivers stunning VR immersion with 4K per-eye resolution and a 120Hz refresh rate for ultra-smooth visuals. Features inside-out tracking, no external sensors required, and a comfortable halo head strap. Supports both standalone and PC VR gaming via USB-C or WiFi 6. The redesigned controllers offer precise haptic feedback and gesture recognition. Includes access to VirtuaView’s expansive VR content library.",
    "company": "VirtuaView",
    "warranty": "years:1",
    "category": "electronics",
    "rating": 4.2
  },
  {
    "id": 19,
    "name": "Dash Cam",
    "price": 11129.99,
    "image": "/images/dashcam.jpg",
    "description": "1440p recording, night vision",
    "information": "The RoadEye V3 records crystal-clear 1440p footage with wide 160° field of view and advanced night vision. Features loop recording, G-sensor impact detection, and parking surveillance mode. Supports WiFi connectivity for easy file transfers and app-based live preview. Includes a 32GB microSD card and adhesive mount. The sleek, low-profile design ensures discreet windshield installation.",
    "company": "RoadEye",
    "warranty": "years:1",
    "category": "electronics",
    "rating": 4.5
  },
  {
    "id": 20,
    "name": "Smart Doorbell",
    "price": 699.99,
    "image": "/images/doorbell.jpg",
    "description": "HD video, two-way audio",
    "information": "The SecureRing 3 offers crisp 1080p HD video with night vision and real-time two-way audio via your smartphone. Features motion detection alerts, cloud and local storage options, and customizable detection zones. Compatible with Alexa and Google Assistant for seamless smart home integration. Includes a rechargeable battery and optional hardwiring kit for continuous power.",
    "company": "SecureRing",
    "warranty": "years:1",
    "category": "electronics",
    "rating": 4.6
  },
  {
    "id": 21,
    "name": "Men's Casual Shirt",
    "price": 229.99,
    "image": "/images/shirt.jpg",
    "description": "Discount️‍ 20%🔥. 100% cotton, machine washable.",
    "information": "The UrbanClassic button-down shirt is crafted from premium 100% Egyptian cotton for exceptional softness and breathability. Features a classic fit with slightly tapered silhouette, perfect for both office and casual wear. The reinforced collar and button placket maintain structure after repeated washing. Available in 12 versatile colors from crisp white to deep navy. Tagless label prevents irritation. Machine wash cold and tumble dry low for easy care. Pairs perfectly with dress pants or jeans for versatile styling options.",
    "company": "UrbanClassic",
    "warranty": "months:6 against manufacturing defects",
    "category": "clothing",
    "rating": 4.2
  },
  {
    "id": 22,
    "name": "Women's Running Shoes",
    "price": 489.99,
    "image": "/images/shoes.jpg",
    "description": "Discount️‍ 20%🔥. Lightweight, breathable mesh upper.",
    "information": "The RunFlex Pro women's running shoes feature a revolutionary energy-return midsole that provides 20% more rebound than standard foam. The engineered mesh upper offers targeted breathability with seamless construction to prevent irritation. Includes OrthoLite sockliner for moisture management and odor control. The durable rubber outsole features multi-directional lugs for traction on various surfaces. Weighs just 220g per shoe (size 7). Perfect for road running up to marathon distances. Available in 8 vibrant color combinations.",
    "company": "RunFlex",
    "warranty": "months:2 sole warranty",
    "category": "clothing",
    "rating": 4.6
  },
  {
    "id": 23,
    "name": "Denim Jeans",
    "price": 349.99,
    "image": "/images/jeans.jpg",
    "description": "Slim fit, stretch denim fabric",
    "information": "The DenimCraft Slim Stretch jeans combine authentic selvedge denim look with modern comfort. Made with 98% cotton and 2% elastane for flexibility without losing shape. Features a mid-rise waist and tapered leg opening. The garment-dyed finish provides rich, saturated color that resists fading. Reinforced stress points at pockets and seams ensure durability. The eco-friendly manufacturing process uses 30% less water than conventional denim production. Available in raw indigo, black, and medium wash finishes.",
    "company": "DenimCraft",
    "warranty": "months:6 sole warranty",
    "category": "clothing",
    "rating": 4.3
  },
  {
    "id": 24,
    "name": "Winter Jacket",
    "price": 1129.99,
    "image": "/images/jacket.jpg",
    "description": "Waterproof with thermal insulation",
    "information": "The ArcticShield Extreme winter jacket features 650-fill power down insulation with HydroDown water-resistant treatment. The 3-layer StormArmor shell is completely waterproof (20,000mm rating) yet highly breathable. Includes adjustable storm hood, rib-knit cuffs, and inner storm skirt to seal out wind and snow. Multiple zippered pockets including internal security pocket. The articulated elbows and gusseted underarms allow complete freedom of movement. Rated for temperatures down to -30°C (-22°F). Perfect for winter sports or extreme cold weather conditions.",
    "company": "ArcticShield",
    "warranty": "years:1",
    "category": "clothing",
    "rating": 4.7
  },
  {
    "id": 25,
    "name": "Silk Tie",
    "price": 174.99,
    "image": "/images/tie.jpg",
    "description": "Premium silk, various colors",
    "information": "The LuxeSilk necktie is handcrafted from 100% pure mulberry silk with a luxurious hand-rolled finish. Features traditional seven-fold construction for perfect knotting and drape. The 3.5\" width is ideal for modern business attire. Each tie is cut on the bias for optimal diagonal pattern alignment. Includes hidden loop keeper and branded tipping. Backed with premium wool interlining for structure. Available in over 50 patterns from classic solids to contemporary geometric designs. Hand wash cold with mild detergent and hang dry to maintain luster.",
    "company": "LuxeSilk",
    "warranty": "days:30",
    "category": "clothing",
    "rating": 4.1
  },
  {
    "id": 26,
    "name": "Yoga Pants",
    "price": 239.99,
    "image": "/images/yogapants.jpg",
    "description": "High-waisted, moisture-wicking",
    "information": "The FlexiFit High-Waist Yoga Pants are made from revolutionary Nylon-Spandex blend fabric with 4-way stretch for complete freedom of movement. The wide waistband provides tummy control without rolling down. Features sweat-wicking technology with odor-resistant treatment. The gusseted crotch and flatlock seams prevent chafing during intense workouts. Side pockets securely hold phones or small essentials. The ankle-length design with subtle mesh panels offers both coverage and ventilation. Machine washable with color-lock technology to maintain deep black hue.",
    "company": "FlexiFit",
    "warranty": "months:2 sole warranty",
    "category": "clothing",
    "rating": 4.5
  },
  {
    "id": 27,
    "name": "Baseball Cap",
    "price": 109.99,
    "image": "/images/cap.jpg",
    "description": "Adjustable, breathable fabric",
    "information": "The SportFlex Performance Cap features moisture-wicking, quick-dry fabric that keeps you cool in hot conditions. The curved visor provides excellent sun protection with anti-glare underside. Features an adjustable snapback closure for perfect fit. The structured front panels maintain shape while the mesh back panels enhance ventilation. The sweatband is treated with antimicrobial technology to prevent odor. The embroidered logo is crafted with UV-resistant thread. Perfect for outdoor activities, sports, or casual wear. Hand wash recommended to preserve shape and color.",
    "company": "SportFlex",
    "warranty": "days:30",
    "category": "clothing",
    "rating": 4.0
  },
  {
    "id": 28,
    "name": "Cotton Socks (6-Pack)",
    "price": 154.99,
    "image": "/images/socks.jpg",
    "description": "Breathable cotton, assorted colors",
    "information": "The ComfortStep Everyday Socks are crafted from premium combed cotton with reinforced heel and toe for extended durability. Features arch support and seamless toe closure for all-day comfort. The moisture-wicking technology keeps feet dry while the breathable mesh panels enhance airflow. The stay-up design uses silicone grippers to prevent slipping. Each pack includes 3 pairs of crew length and 3 pairs of ankle socks in coordinating colors. The gradual compression provides light support without restricting circulation. Machine wash warm, tumble dry low.",
    "company": "ComfortStep",
    "warranty": "days:30",
    "category": "clothing",
    "rating": 4.2
  },
  {
    "id": 29,
    "name": "Leather Belt",
    "price": 134.99,
    "image": "/images/belt.jpg",
    "description": "Genuine leather, adjustable",
    "information": "The HeritageGenuine leather belt is crafted from full-grain Italian leather that develops a rich patina over time. Features a solid brass buckle with scratch-resistant coating. The 1.5\" width is ideal for both casual and business wear. The vegetable-tanned leather is free from harmful chemicals and dyes. The belt is reversible with a subtle grain pattern on one side and smooth finish on the other. Includes 7 adjustment holes to accommodate waist fluctuations. Each belt is hand-burnished for a distinctive finish that improves with age.",
    "company": "Heritage",
    "warranty": "months:6 sole warranty",
    "category": "clothing",
    "rating": 4.4
  },
  {
    "id": 30,
    "name": "Wool Scarf",
    "price": 99.99,
    "image": "/images/scarf.jpg",
    "description": "100% merino wool, winter accessory",
    "information": "The AlpineWool Merino Scarf is handwoven from extra-fine 18.5 micron merino wool for exceptional softness without itchiness. The oversized 12\" x 72\" dimensions provide ample coverage while the lightweight fabric drapes beautifully. Naturally regulates body temperature and wicks moisture away. The subtle herringbone pattern adds texture without bulk. The fringed ends are hand-knotted for durability. Available in 8 classic colors from charcoal to camel. Naturally resistant to odors and wrinkles. Hand wash cold with wool detergent and lay flat to dry to maintain shape.",
    "company": "AlpineWool",
    "warranty": "months:2",
    "category": "clothing",
    "rating": 4.3
  },
  {
    "id": 31,
    "name": "Summer Dress",
    "price": 949.99,
    "image": "/images/dress.jpg",
    "description": "Lightweight cotton, floral pattern",
    "information": "The SunWeave Summer Dress is crafted from 100% organic cotton with a breathable, airy weave perfect for warm weather. Features an adjustable waist tie, hidden side pockets, and a flattering A-line silhouette. The vibrant floral print is fade-resistant even after repeated washes. Lined for opacity with a soft, hypoallergenic inner layer. Machine wash cold and tumble dry low to preserve color and shape.",
    "company": "SunWeave",
    "warranty": "months:2",
    "category": "clothing",
    "rating": 4.5
  },
  {
    "id": 32,
    "name": "Leather Wallet",
    "price": 139.99,
    "image": "/images/wallet.jpg",
    "description": "Genuine leather, RFID protection",
    "information": "The UrbanHide Leather Wallet is made from full-grain Italian leather, hand-stitched for durability. Features 8 card slots, 2 hidden compartments, and RFID-blocking technology to protect against digital theft. The natural leather patina develops over time for a unique look. Includes a removable ID window and a secure coin pouch. Condition with leather balm every 6 months to maintain suppleness.",
    "company": "UrbanHide",
    "warranty": "months:2",
    "category": "clothing",
    "rating": 4.4
  },
  {
    "id": 33,
    "name": "Swim Trunks",
    "price": 134.99,
    "image": "/images/swimtrunks.jpg",
    "description": "Quick-dry fabric, UPF 50+",
    "information": "The AquaVenture Swim Trunks are designed for performance with chlorine-resistant, quick-dry fabric that provides UPF 50+ sun protection. Features a secure zip pocket, adjustable drawstring waist, and a lightweight mesh liner. The 7-inch inseam offers freedom of movement while maintaining coverage. Resistant to fading and saltwater damage. Rinse after use and hang dry.",
    "company": "AquaVenture",
    "warranty": "months:2",
    "category": "clothing",
    "rating": 4.3
  },
  {
    "id": 34,
    "name": "Winter Gloves",
    "price": 124.99,
    "image": "/images/gloves.jpg",
    "description": "Thermal insulation, touchscreen compatible",
    "information": "The FrostGrip Winter Gloves combine thermal insulation with touchscreen-compatible fingertips for convenience. The outer shell is water-resistant, while the inner fleece lining retains heat in sub-zero temperatures. Reinforced stitching at stress points ensures longevity. The adjustable wrist strap provides a snug fit. Hand wash with mild detergent and air dry.",
    "company": "FrostGrip",
    "warranty": "months:2",
    "category": "clothing",
    "rating": 4.2
  },
  {
    "id": 35,
    "name": "Athletic Shorts",
    "price": 129.99,
    "image": "/images/shorts.jpg",
    "description": "Moisture-wicking, 7\" inseam",
    "information": "The FlexRun Athletic Shorts are engineered with 4-way stretch fabric for unrestricted movement. The moisture-wicking technology keeps you dry during intense workouts, while the anti-odor treatment prevents bacterial buildup. Features a hidden key pocket and reflective logos for low-light visibility. Machine wash cold and avoid fabric softeners.",
    "company": "FlexRun",
    "warranty": "months:2",
    "category": "clothing",
    "rating": 4.4
  },
  {
    "id": 36,
    "name": "Knit Sweater",
    "price": 459.99,
    "image": "/images/sweater.jpg",
    "description": "Wool blend, crew neck",
    "information": "The HeritageKnit Sweater is crafted from a premium 80% merino wool and 20% cashmere blend for unmatched softness and warmth. The ribbed cuffs and hem provide a tailored fit, while the reinforced shoulders resist stretching. Designed to resist pilling with proper care. Hand wash in cold water and lay flat to dry.",
    "company": "HeritageKnit",
    "warranty": "months:2",
    "category": "clothing",
    "rating": 4.3
  },
  {
    "id": 37,
    "name": "Rain Jacket",
    "price": 1079.99,
    "image": "/images/rainjacket.jpg",
    "description": "Waterproof, breathable fabric",
    "information": "The StormShield Rain Jacket features a 3-layer Gore-Tex membrane for 100% waterproofing without sacrificing breathability. Fully seam-sealed with adjustable hood, cuffs, and hem for a customizable fit. Includes underarm vents for temperature regulation and a lifetime warranty against manufacturing defects. Spot clean with a damp cloth and reproof annually.",
    "company": "StormShield",
    "warranty": "years:2 (manufacturing defects)",
    "category": "clothing",
    "rating": 4.5
  },
  {
    "id": 38,
    "name": "Graphic T-Shirt",
    "price": 319.99,
    "image": "/images/tshirt.jpg",
    "description": "100% cotton, printed design",
    "information": "The ArtTease Graphic T-Shirt uses ultra-soft ring-spun cotton for a premium feel. The eco-friendly dye process ensures vibrant, long-lasting prints that won’t crack or fade. Pre-shrunk fabric maintains shape after washing. Designed with a slightly tapered fit for a modern silhouette. Wash inside out in cold water to preserve print.",
    "company": "ArtTease",
    "warranty": "months:2",
    "category": "clothing",
    "rating": 4.1
  },
  {
    "id": 39,
    "name": "Formal Blazer",
    "price": 949.99,
    "image": "/images/blazer.jpg",
    "description": "Slim fit, wool blend",
    "information": "The ExecutiveCraft Blazer is tailored from a luxurious wool-elastane blend for structure with stretch. Features a notched lapel, functional cuff buttons, and a breathable satin lining. The silhouette is optimized for movement while maintaining a sharp drape. Includes an interior pen pocket and ticket holder. Dry clean only.",
    "company": "ExecutiveCraft",
    "warranty": "months:2",
    "category": "clothing",
    "rating": 4.6
  },
  {
    "id": 40,
    "name": "Hooded Sweatshirt",
    "price": 344.99,
    "image": "/images/hoodie.jpg",
    "description": "Fleece lining, adjustable drawstring",
    "information": "The StreetFlex Hoodie is built with a double-layered fleece interior for warmth and a durable cotton-polyester exterior. Features a kangaroo pocket, reinforced stitching, and a brushed interior for comfort. The adjustable drawstring hood and ribbed cuffs seal in heat. Machine wash cold and tumble dry low.",
    "company": "StreetFlex",
    "warranty": "months:2",
    "category": "clothing",
    "rating": 4.4
  },
  {
    "id": 41,
    "name": "Chronograph Watch",
    "price": 799.99,
    "image": "/images/watch1.jpg",
    "description": "Discount️‍ 20%🔥. Stainless steel, water resistant",
    "information": "The PrecisionTime Chronograph features a Swiss quartz movement with sub-dials for seconds, minutes, and hours. The 42mm stainless steel case is scratch-resistant with a sapphire crystal face. Water-resistant to 100m (10ATM), suitable for swimming. Includes a genuine leather strap with quick-release pins for easy swapping. 2-year battery life with replaceable cell.",
    "company": "PrecisionTime",
    "warranty": "years:2",
    "category": "watches",
    "rating": 4.6
  },
  {
    "id": 42,
    "name": "Smart Fitness Watch",
    "price": 1059.99,
    "image": "/images/watch2.jpg",
    "description": "Discount️‍ 20%🔥. Heart rate monitor, GPS tracking",
    "information": "The FitTech Pro Smart Watch features 24/7 heart rate monitoring, built-in GPS for route tracking, and a 1.4\" AMOLED touchscreen. Tracks sleep stages, blood oxygen levels, and calories burned with 95% accuracy. Compatible with iOS and Android, with 7-day battery life. Swim-proof up to 50m and includes stress-tracking algorithms. Syncs wirelessly to the FitTech app for detailed health analytics.",
    "company": "FitTech",
    "warranty": "years:2",
    "category": "watches",
    "rating": 4.5
  },
  {
    "id": 43,
    "name": "Luxury Dress Watch",
    "price": 1499.99,
    "image": "/images/watch3.jpg",
    "description": "Swiss movement, leather strap",
    "information": "The Horologe Swiss Dress Watch is powered by a precise ETA 2892-A2 automatic movement, visible through the sapphire crystal caseback. The 40mm rose gold-plated case pairs with a hand-stitched Italian calfskin strap. Features a guilloché dial with Roman numerals and a power reserve of 42 hours. Water-resistant to 30m. Servicing recommended every 5 years to maintain accuracy.",
    "company": "Horologe",
    "warranty": "years:5",
    "category": "watches",
    "rating": 4.8
  },
  {
    "id": 44,
    "name": "Digital Sports Watch",
    "price": 979.99,
    "image": "/images/watch4.jpg",
    "description": "Stopwatch, backlight, alarm",
    "information": "The TitanTrack Digital Watch is built for athletes with a shock-resistant fiberglass case and a high-contrast LCD display. Includes 5 alarms, 100-lap memory, and a countdown timer. The electroluminescent backlight ensures visibility in low light. Water-resistant to 100m, making it suitable for swimming. Powered by a 10-year lithium battery.",
    "company": "TitanTrack",
    "warranty": "years:3",
    "category": "watches",
    "rating": 4.2
  },
  {
    "id": 45,
    "name": "Diver's Watch",
    "price": 1299.99,
    "image": "/images/watch5.jpg",
    "description": "200m water resistance, unidirectional bezel",
    "information": "The AbyssMaster Diver's Watch meets ISO 6425 standards with 200m water resistance and a helium escape valve. The ceramic unidirectional bezel tracks dive time, while the luminescent markers glow for 25+ hours. Features a Miyota 9015 automatic movement and a scratch-resistant sapphire crystal. Pressure-tested to ensure reliability at depth.",
    "company": "AbyssMaster",
    "warranty": "years:5",
    "category": "watches",
    "rating": 4.7
  },
  {
    "id": 46,
    "name": "Minimalist Watch",
    "price": 1029.99,
    "image": "/images/watch6.jpg",
    "description": "Slim design, mesh metal band",
    "information": "The Nuovo Minimalist Watch features a 38mm titanium case and a Milanese mesh strap for featherlight comfort. The ultra-thin Japanese quartz movement measures just 6mm thick. The matte black dial has no numerals for a clean aesthetic. Water-resistant to 50m. Ideal for everyday wear with business or casual attire.",
    "company": "Nuovo",
    "warranty": "years:3",
    "category": "watches",
    "rating": 4.4
  },
  {
    "id": 47,
    "name": "Pilot Watch",
    "price": 1349.99,
    "image": "/images/watch7.jpg",
    "description": "Aviation-inspired, luminous hands",
    "information": "The AeroClassic Pilot Watch boasts a 44mm stainless steel case with a slide-rule bezel for aviation calculations. The Super-LumiNova-coated hands and markers ensure readability in darkness. Powered by a Swiss Sellita SW200-1 movement with a 38-hour reserve. Includes a anti-magnetic Faraday cage for precision. Water-resistant to 100m.",
    "company": "AeroClassic",
    "warranty": "years:4",
    "category": "watches",
    "rating": 4.6
  },
  {
    "id": 48,
    "name": "Kids Digital Watch",
    "price": 424.99,
    "image": "/images/watch8.jpg",
    "description": "Colorful, durable, splash-proof",
    "information": "The PlayTime Kids Watch features a silicone band with hypoallergenic materials and a shatter-resistant mineral crystal face. Includes a stopwatch, countdown timer, and 12/24-hour formats. Splash-proof for handwashing and rain (not for swimming). Parental controls allow alarm customization. Battery lasts 2 years with typical use.",
    "company": "PlayTime",
    "warranty": "years:1",
    "category": "watches",
    "rating": 4.1
  },
  {
    "id": 49,
    "name": "Solar-Powered Watch",
    "price": 1079.99,
    "image": "/images/watch9.jpg",
    "description": "Eco-friendly, never needs battery",
    "information": "The EcoDrive Solar Watch converts sunlight or artificial light into energy, stored in a rechargeable cell for 6+ months in darkness. The 41mm stainless steel case houses a Japanese Eco-Drive movement with ±15 seconds/month accuracy. Features a date window and 100m water resistance. No battery replacements needed.",
    "company": "EcoDrive",
    "warranty": "years:5",
    "category": "watches",
    "rating": 4.5
  },
  {
    "id": 50,
    "name": "Fashion Bracelet Watch",
    "price": 689.99,
    "image": "/images/watch10.jpg",
    "description": "Trendy design, interchangeable bands",
    "information": "The StyleLink Bracelet Watch offers a modular design with quick-release bands (included: stainless steel mesh, leather, and silicone). The 36mm rose gold case houses a reliable Miyota quartz movement. The mother-of-pearl dial changes hue under light. Water-resistant to 30m. Perfect for mixing and matching with outfits.",
    "company": "StyleLink",
    "warranty": "years:2",
    "category": "watches",
    "rating": 4.3
  },
  {
    "id": 51,
    "name": "Smartwatch Pro",
    "price": 6229.99,
    "image": "/images/watch11.jpg",
    "description": "AMOLED display, blood oxygen monitor",
    "information": "The OmniSmart Pro features a 1.6\" Always-On AMOLED display with 1000-nit brightness. Tracks ECG, SpO2, and skin temperature. Includes LTE connectivity, voice assistant, and 128GB storage. The titanium case and sapphire crystal withstand extreme conditions. Battery lasts 3 days with heavy use or 7 days in power-saving mode.",
    "company": "OmniSmart",
    "warranty": "years:3",
    "category": "watches",
    "rating": 4.6
  },
  {
    "id": 52,
    "name": "Military Tactical Watch",
    "price": 1049.99,
    "image": "/images/watch12.jpg",
    "description": "Shock resistant, compass feature",
    "information": "The Tactix Military Watch meets MIL-STD-810G standards for shock, vibration, and thermal resistance. The built-in digital compass, altimeter, and barometer support outdoor navigation. The carbon fiber-reinforced case and NATO strap ensure durability. Night-vision compatible with a stealth mode to disable all lights. Water-resistant to 200m.",
    "company": "Tactix",
    "warranty": "years:5",
    "category": "watches",
    "rating": 4.4
  },
  {
    "id": 53,
    "name": "Rose Gold Watch",
    "price": 1979.99,
    "image": "/images/watch13.jpg",
    "description": "Elegant design, genuine leather strap",
    "information": "The LuxeRose Gold Watch features a 40mm 18k rose gold-plated case with a Swiss Ronda quartz movement for precision. The genuine alligator leather strap is hand-stitched and lined with soft calfskin. The mother-of-pearl dial is adorned with diamond-cut indices and a date window at 3 o'clock. Water-resistant to 50m. Includes a presentation box and polishing cloth.",
    "company": "LuxeRose",
    "warranty": "years:5",
    "category": "watches",
    "rating": 4.5
  },
  {
    "id": 54,
    "name": "Analog-Digital Watch",
    "price": 1099.99,
    "image": "/images/watch14.jpg",
    "description": "Hybrid display, multiple time zones",
    "information": "The ChronoHybrid Watch combines analog elegance with digital functionality. The 42mm stainless steel case houses a Japanese solar-powered movement and an LCD sub-display showing a second time zone, alarm, and stopwatch. The sapphire crystal is anti-reflective, and the bracelet is adjustable with a push-button clasp. Water-resistant to 100m.",
    "company": "ChronoHybrid",
    "warranty": "years:3",
    "category": "watches",
    "rating": 4.3
  },
  {
    "id": 55,
    "name": "Limited Edition Watch",
    "price": 15599.99,
    "image": "/images/watch15.jpg",
    "description": "Collector's item, numbered series",
    "information": "The Heritage Limited Edition (#/500) features a hand-assembled Swiss tourbillon movement visible through the skeletonized dial. The 44mm platinum case is paired with a hand-stitched ostrich leather strap. Each watch includes a certificate of authenticity and a private concierge service for maintenance. Water-resistant to 30m.",
    "company": "Heritage",
    "warranty": "Lifetime (mechanical parts)",
    "category": "watches",
    "rating": 4.7
  },
  {
    "id": 56,
    "name": "Wooden Watch",
    "price": 819.99,
    "image": "/images/watch16.jpg",
    "description": "Sustainable bamboo, unique grain",
    "information": "The EcoWood Watch uses reclaimed teak and bamboo for a lightweight, hypoallergenic case. The Japanese Miyota movement ensures accuracy, while the natural wood grain ensures no two watches are identical. The plant-based leather strap is biodegradable. Water-resistant to 30m (splash-proof).",
    "company": "EcoWood",
    "warranty": "years:2",
    "category": "watches",
    "rating": 4.2
  },
  {
    "id": 57,
    "name": "Thin Dress Watch",
    "price": 1059.99,
    "image": "/images/watch17.jpg",
    "description": "Ultra-slim 6mm profile",
    "information": "The SlimHorizon Watch measures just 6mm thick with a 38mm stainless steel case and a Swiss quartz movement. The minimalist dial features razor-thin hands and a micro-textured finish. The integrated Milanese mesh strap adjusts for a seamless fit. Ideal for formal wear. Water-resistant to 30m.",
    "company": "SlimHorizon",
    "warranty": "years:3",
    "category": "watches",
    "rating": 4.4
  },
  {
    "id": 58,
    "name": "Rugged Outdoor Watch",
    "price": 1399.99,
    "image": "/images/watch18.jpg",
    "description": "Built-in altimeter and barometer",
    "information": "The TerraTrek Outdoor Watch is MIL-STD-810G certified for shock, dust, and extreme temperatures. The ABC sensors (altimeter, barometer, compass) provide real-time environmental data. The 46mm titanium case has a sapphire crystal with anti-glare coating. Battery lasts 1 year in expedition mode. Water-resistant to 200m.",
    "company": "TerraTrek",
    "warranty": "years:5",
    "category": "watches",
    "rating": 4.5
  },
  {
    "id": 59,
    "name": "Vintage Watch",
    "price": 9249.99,
    "image": "/images/watch19.jpg",
    "description": "Retro design, hand-wound movement",
    "information": "The RetroClassic Watch revives a 1960s design with a manually wound Swiss ETA 2801 movement. The 36mm stainless steel case has a domed hesalite crystal for authenticity. The heat-blued steel hands and cream dial age gracefully. Includes a vintage-style leather strap. Water-resistant to 30m.",
    "company": "RetroClassic",
    "warranty": "years:4",
    "category": "watches",
    "rating": 4.6
  },
  {
    "id": 60,
    "name": "Connected Watch",
    "price": 1479.99,
    "image": "/images/watch20.jpg",
    "description": "Smart notifications, app support",
    "information": "The LinkSmart Watch syncs with iOS/Android to display calls, texts, and app alerts. The 1.3\" AMOLED touchscreen has a 60Hz refresh rate. Tracks heart rate, steps, and sleep. The aluminum case is paired with a fluoroelastomer band for comfort. Battery lasts 5 days. Water-resistant to 50m.",
    "company": "LinkSmart",
    "warranty": "years:2",
    "category": "watches",
    "rating": 4.3
  },
  {
    "id": 61,
    "name": "Organic Apples (1kg)",
    "price": 63.99,
    "image": "/images/apples.jpg",
    "description": "Discount️‍ 20%🔥. Fresh, pesticide-free",
    "information": "Grown in certified organic orchards in Washington State. Crisp and juicy with a balanced sweet-tart flavor. Rich in fiber and vitamin C. Store in the refrigerator to maintain freshness for up to 4 weeks. USDA Organic and Non-GMO Project Verified.",
    "company": "GreenOrchard",
    "freshness_guarantee": "days:14",
    "category": "groceries",
    "rating": 4.7
  },
  {
    "id": 62,
    "name": "Whole Grain Bread",
    "price": 5.49,
    "image": "/images/bread.jpg",
    "description": "Discount️‍ 20%🔥. High fiber, no preservatives",
    "information": "Baked daily with stone-ground whole wheat, flaxseeds, and quinoa. Contains 5g of fiber per slice. Free from artificial additives and high-fructose corn syrup. Best consumed within 5 days or freeze for up to 3 months. Certified halal and Vegan.",
    "company": "PureGrains",
    "shelf_life": "days:5 (unopened)",
    "category": "groceries",
    "rating": 4.5
  },
  {
    "id": 63,
    "name": "Free-Range Eggs (12)",
    "price": 75,
    "image": "/images/eggs.jpg",
    "description": "Grade AA, large",
    "information": "Sourced from hens raised on pasture with access to organic feed. Eggs have deep orange yolks and firm whites. Rich in omega-3s and vitamin D. Store in the refrigerator at ≤4°C. Certified Humane and Organic. Use within 3 weeks of purchase.",
    "company": "HappyHen Farms",
    "freshness_guarantee": "days:21",
    "category": "groceries",
    "rating": 4.8
  },
  {
    "id": 64,
    "name": "Organic Milk (1L)",
    "price": 40.99,
    "image": "/images/milk.jpg",
    "description": "Pasteurized, vitamin D enriched",
    "information": "CreamTop Organic Milk is sourced from grass-fed cows raised without antibiotics or synthetic hormones. Rich in omega-3s and vitamin D, it's homogenized for consistent texture and ultra-pasteurized to extend freshness. Shake well before use. Best enjoyed within 7 days of opening. Store refrigerated at ≤4°C. USDA Organic certified.",
    "company": "CreamTop",
    "shelf_life": "days:14 unopened, days:7 after opening",
    "category": "groceries",
    "rating": 4.6
  },
  {
    "id": 65,
    "name": "Extra Virgin Olive Oil",
    "price": 108.99,
    "image": "/images/oliveoil.jpg",
    "description": "Cold pressed, 500ml",
    "information": "Olivo Prima Extra Virgin Olive Oil is cold-extracted within 24 hours of harvest from Koroneiki olives in Crete. With an acidity level <0.3%, it has a peppery finish and notes of green apple. Ideal for dressings or low-heat cooking. Store in a cool, dark place to preserve antioxidants. IOC certified and unfiltered for maximum flavor.",
    "company": "Olivo Prima",
    "shelf_life": "Months:24 (after opening: Months:6)",
    "category": "groceries",
    "rating": 4.7
  },
  {
    "id": 66,
    "name": "Organic Chicken Breast 1KG",
    "price": 239.99,
    "image": "/images/chicken.jpg",
    "description": "Air-chilled, no antibiotics",
    "information": "PurePasture Organic Chicken is air-chilled (never water-injected) for superior texture and flavor. Raised on certified organic feed with outdoor access. Each breast is hand-trimmed and vacuum-sealed for freshness. For best results, cook to an internal temperature of 74°C. Use or freeze within 2 days of purchase.",
    "company": "PurePasture",
    "freshness_guarantee": "days:3 refrigerated, Months:9 frozen",
    "category": "groceries",
    "rating": 4.6
  },
  {
    "id": 67,
    "name": "Fresh Spinach (200g)",
    "price": 5.29,
    "image": "/images/spinach.jpg",
    "description": "Pre-washed, ready to eat",
    "information": "GreenLeaf Spinach is triple-washed in ozone-treated water for safety. Packed in breathable clamshells to reduce spoilage. Rich in iron, vitamin K, and folate. Leaves are tender with minimal stems. Refrigerate unopened and consume within 5 days. For extended freshness, line container with paper towels to absorb moisture.",
    "company": "GreenLeaf",
    "shelf_life": "days:5 unopened",
    "category": "groceries",
    "rating": 4.4
  },
  {
    "id": 68,
    "name": "Greek Yogurt (500g)",
    "price": 13.49,
    "image": "/images/yogurt.jpg",
    "description": "High protein, probiotic",
    "information": "Yoguri Authentic Greek Yogurt is strained for 24 hours to achieve a thick, creamy texture with 10g protein per 100g. Contains live active cultures (L. acidophilus, Bifidus). No gelatin or thickeners added. Enjoy with honey or as a sour cream substitute. Stir before use if separated. Kosher and gluten-free.",
    "company": "Yoguri",
    "shelf_life": "days:30 unopened, days:7 after opening",
    "category": "groceries",
    "rating": 4.5
  },
  {
    "id": 69,
    "name": "Dark Chocolate (100g)",
    "price": 52.99,
    "image": "/images/chocolate.jpg",
    "description": "70% cocoa, organic",
    "information": "CacaoReal Dark Chocolate is made from single-origin Peruvian cocoa beans. Slow-conched for 72 hours to develop complex flavors of red berries and nuts. Sweetened with organic cane sugar. Vegan and dairy-free. Store away from heat and sunlight to prevent bloom. Certified Fair Trade and Rainforest Alliance.",
    "company": "CacaoReal",
    "shelf_life": "Months:18",
    "category": "groceries",
    "rating": 4.8
  },
  {
    "id": 70,
    "name": "Organic Coffee Beans 500gm",
    "price": 197.99,
    "image": "/images/coffee.jpg",
    "description": "Fair trade, medium roast",
    "information": "BeanCraft Organic Coffee is shade-grown in Colombia’s Andes Mountains. Medium roast highlights notes of caramel and citrus. Whole beans retain oils longer—grind just before brewing. For best flavor, use within 3 weeks of opening. Store in an airtight container away from light. Certified Organic and Bird Friendly.",
    "company": "BeanCraft",
    "shelf_life": "Months:12 unopened, weeks:3 after opening",
    "category": "groceries",
    "rating": 4.7
  },
  {
    "id": 71,
    "name": "Honey (500g)",
    "price": 106.99,
    "image": "/images/honey.jpg",
    "description": "Raw, unfiltered local honey",
    "information": "SunHive Raw Honey is harvested from urban apiaries, preserving natural enzymes and pollen. Crystallization is normal—warm gently in water to liquefy. Use to soothe sore throats or sweeten teas. Not recommended for infants under 1 year. Never heat above 40°C to maintain benefits. 100% pure with no additives.",
    "company": "SunHive",
    "shelf_life": "Indefinite (best within 2 years)",
    "category": "groceries",
    "rating": 4.6
  },
  {
    "id": 72,
    "name": "Almonds (200g)",
    "price": 105.99,
    "image": "/images/almonds.jpg",
    "description": "Raw, unsalted California almonds",
    "information": "NutriGrove Almonds are Non-GMO Project Verified and packed with vitamin E and healthy fats. Dry-roasted at low temperatures to preserve nutrients. Ideal for snacking, baking, or making almond milk. Store in the freezer to prevent rancidity. Resealable bag maintains freshness. Kosher and vegan.",
    "company": "NutriGrove",
    "shelf_life": "Months:24 unopened, Months:6 after opening",
    "category": "groceries",
    "rating": 4.5
  },
  {
    "id": 73,
    "name": "Basmati Rice (1kg)",
    "price": 44.49,
    "image": "/images/rice.jpg",
    "description": "Premium long grain rice",
    "information": "RoyalHarvest Basmati is aged for 12 months for superior aroma and elongation. Grown in the Himalayan foothills, each grain remains separate when cooked. Rinse before cooking to remove excess starch. Store in an airtight container to prevent moisture absorption. Non-GMO and gluten-free.",
    "company": "RoyalHarvest",
    "shelf_life": "Months:24",
    "category": "groceries",
    "rating": 4.4
  },
  {
    "id": 74,
    "name": "Tomato Sauce (500g)",
    "price": 22.99,
    "image": "/images/tomatosauce.jpg",
    "description": "No added sugar, organic tomatoes",
    "information": "VitaTomato Sauce uses San Marzano tomatoes slow-simmered with basil and garlic. BPA-free packaging. Low acidity (pH 4.3) for sensitive stomachs. Use as a pizza base or pasta sauce. Refrigerate after opening and consume within 5 days. USDA Organic and Italian DOP certified.",
    "company": "VitaTomato",
    "shelf_life": "Months:18 unopened, days:5 after opening",
    "category": "groceries",
    "rating": 4.3
  },
  {
    "id": 75,
    "name": "Frozen Berries (500g)",
    "price": 65.49,
    "image": "/images/berries.jpg",
    "description": "Mixed berries, flash frozen",
    "information": "BerryFrost Blend includes strawberries, blueberries, and raspberries frozen at peak ripeness to lock in nutrients. No added syrups or sweeteners. Use in smoothies, baking, or thaw for toppings. Resealable bag allows portion control. Store at -18°C or below. Product of USA and Canada.",
    "company": "BerryFrost",
    "shelf_life": "Months:24 frozen",
    "category": "groceries",
    "rating": 4.5
  },
  {
    "id": 76,
    "name": "Granola (400g)",
    "price": 64.99,
    "image": "/images/granola.jpg",
    "description": "Gluten-free, honey sweetened",
    "information": "CrunchCraft Granola combines rolled oats, almonds, and sunflower seeds with a touch of local honey. Baked in small batches for even crispness. Free from refined sugars and artificial binders. Enjoy with yogurt or as a snack. Store in an airtight container to maintain crunch. Certified gluten-free by GFCO.",
    "company": "CrunchCraft",
    "shelf_life": "Months:3 unopened, Months:2 after opening",
    "category": "groceries",
    "rating": 4.4
  },
  {
    "id": 77,
    "name": "Green Tea (20 bags)",
    "price": 43.49,
    "image": "/images/greentea.jpg",
    "description": "Antioxidant rich, organic",
    "information": "ISIS Green Tea uses first-flush leaves from Japan’s Shizuoka region. Steam-pressed to preserve catechins and L-theanine. Each bag brews 2-3 cups. Best steeped at 80°C for 2 minutes. Store away from light and strong odors to prevent flavor loss. USDA Organic and JAS certified.",
    "company": "isis",
    "shelf_life": "Months:18",
    "category": "groceries",
    "rating": 4.6
  },
  {
    "id": 78,
    "name": "Peanut Butter (500g)",
    "price": 114.29,
    "image": "/images/peanutbutter.jpg",
    "description": "100% peanuts, no additives",
    "information": "NutPure Peanut Butter is made from single-origin Valencia peanuts, slow-roasted and stone-ground for maximum flavor. Contains no added oils, sugars, or preservatives. Natural oil separation is normal - stir before use. Rich in protein and healthy fats. Store at room temperature for up to 3 months after opening. Certified organic and vegan.",
    "company": "NutPure",
    "shelf_life": "Months:12 unopened, Months:1 after opening",
    "category": "groceries",
    "rating": 4.7
  },
  {
    "id": 79,
    "name": "Pasta (500g)",
    "price": 19.99,
    "image": "/images/pasta.jpg",
    "description": "Durum wheat, bronze die cut",
    "information": "PastaFino artisan pasta is extruded through bronze dies for a rough texture that holds sauce perfectly. Made from 100% Italian durum wheat semolina. Slow-dried at low temperatures to preserve nutrients and flavor. Cooks al dente in 8-10 minutes. Store in a cool, dry place. Non-GMO and kosher certified.",
    "company": "PastaFino",
    "shelf_life": "Months:24",
    "category": "groceries",
    "rating": 4.3
  },
  {
    "id": 80,
    "name": "Mineral Water (6x1L)",
    "price": 43.99,
    "image": "/images/water.jpg",
    "description": "Natural spring water",
    "information": "Hepar Natural Spring Water is sourced from a protected underground aquifer in the Alps. Naturally filtered through mineral-rich rock strata, containing balanced electrolytes. Bottled at source in BPA-free PET. Best consumed within 6 months of bottling. Store away from direct sunlight. Meets EU mineral water standards.",
    "company": "Hepar",
    "shelf_life": "Months:24 unopened",
    "category": "groceries",
    "rating": 4.5
  },
  {
    "id": 81,
    "name": "Smart Air Conditioner",
    "price": 21599.99,
    "image": "/images/aircon.jpg",
    "description": "Discount️‍ 20%🔥. WiFi enabled, energy efficient",
    "information": "The ClimateMaster Pro features inverter technology for 40% energy savings and ultra-quiet operation (19dB). Connects to smart home systems via WiFi for voice control and geofencing. Covers 30 sqm with precise ±0.5°C temperature control. Includes HEPA filter and ionizer for air purification. Auto-cleaning function prevents mold buildup.",
    "company": "ClimateMaster",
    "warranty": "years:5 (years:10 on compressor)",
    "category": "home appliances",
    "rating": 4.6
  },
  {
    "id": 82,
    "name": "Robot Vacuum Cleaner",
    "price": 1949.99,
    "image": "/images/vacuum.jpg",
    "description": "Discount️‍ 20%🔥. Self-charging, app controlled",
    "information": "The RoboClean X9 features LIDAR navigation for efficient room mapping and no-go zones. Powerful 2000Pa suction with HEPA filtration captures 99.97% of particles. Works with Alexa/Google Home. Automatically returns to charge and resumes cleaning. Includes mopping function with electronic water control. 150min runtime on hard floors.",
    "company": "RoboClean",
    "warranty": "years:3",
    "category": "home appliances",
    "rating": 4.4
  },
  {
    "id": 83,
    "name": "Air Fryer",
    "price": 1129.99,
    "image": "/images/airfryer.jpg",
    "description": "4.5L capacity, digital controls",
    "information": "The AirCrisp Pro uses rapid air technology with 360° circulation for crispy results using 85% less oil. Features 7 preset programs and 40-200°C temperature range. Non-stick basket is dishwasher safe. Includes recipe app with 200+ ideas. Overheat protection and auto-shutoff for safety. Cooks fries in 15 minutes.",
    "company": "AirCrisp",
    "warranty": "years:2",
    "category": "home appliances",
    "rating": 4.7
  },
  {
    "id": 84,
    "name": "Blender Pro",
    "price": 999.99,
    "image": "/images/blender.jpg",
    "description": "1500W, 6-speed settings",
    "information": "The BlendMaster Pro features a stainless steel 6-blade system that crushes ice in seconds. Variable speed control from 10,000-30,000 RPM. BPA-free 1.8L Tritan jar with ergonomic handle. Pulse function for perfect texture. Includes tamper for thick mixtures. 3-year motor warranty. NSF certified for commercial use.",
    "company": "BlendMaster",
    "warranty": "years:3 (motor), years:1 (parts)",
    "category": "home appliances",
    "rating": 4.5
  },
  {
    "id": 85,
    "name": "Microwave Oven",
    "price": 1649.99,
    "image": "/images/microwave.jpg",
    "description": "25L, 10 power levels",
    "information": "The WaveChef Smart Oven combines microwave, convection, and grill functions. Features sensor cooking for 30+ foods and inverter technology for even heating. Stainless steel interior with ceramic enamel coating for easy cleaning. Child lock and eco mode. Includes steam cleaning function and rotating glass turntable.",
    "company": "WaveChef",
    "warranty": "years:2",
    "category": "home appliances",
    "rating": 4.4
  },
  {
    "id": 86,
    "name": "Coffee Maker",
    "price": 1179.99,
    "image": "/images/coffeemaker.jpg",
    "description": "12-cup programmable",
    "information": "The BrewMaster Elite features thermal stainless steel carafe that keeps coffee hot for 4 hours. Precision brewing with 5 temperature settings (88-96°C) and bloom pause for optimal extraction. 24-hour programmable clock with auto-start. Removable water reservoir and brew basket for easy cleaning. Includes permanent gold-tone filter.",
    "company": "BrewMaster",
    "warranty": "years:3",
    "category": "home appliances",
    "rating": 4.6
  },
  {
    "id": 87,
    "name": "Food Processor",
    "price": 999.99,
    "image": "/images/foodprocessor.jpg",
    "description": "8-cup capacity, multiple attachments",
    "information": "The PrepPro XL includes 10 attachments: dough blade, reversible shredding/slicing discs, citrus press, and emulsifying blade. 1000W motor handles tough jobs like kneading bread dough. Pulse control for precise chopping. BPA-free bowls with measurement markings. Safety interlock prevents operation when improperly assembled.",
    "company": "PrepPro",
    "warranty": "years:3",
    "category": "home appliances",
    "rating": 4.5
  },
  {
    "id": 88,
    "name": "Electric Kettle",
    "price": 649.99,
    "image": "/images/kettle.jpg",
    "description": "1.7L, boil-dry protection",
    "information": "The QuickBoil Pro features variable temperature control (40-100°C) for different teas, with 1°C increments. 3000W rapid heating brings water to boil in 45 seconds. Stainless steel interior with concealed heating element. Automatic shutoff and boil-dry protection. Keep-warm function maintains temperature for 30 minutes. Cordless design with 360° base.",
    "company": "QuickBoil",
    "warranty": "years:2",
    "category": "home appliances",
    "rating": 4.4
  },
  {
    "id": 89,
    "name": "Toaster Oven",
    "price": 989.99,
    "image": "/images/toasteroven.jpg",
    "description": "6-slice capacity, convection",
    "information": "The ToastPro Convection Oven combines 7 cooking functions (bake, broil, toast, etc.) with True Convection technology for even heating. Features a 60-minute timer with auto-shutoff and interior oven light. Non-stick interior with crumb tray for easy cleaning. Fits a 12\" pizza or 6 slices of toast. Includes baking pan and broiling rack.",
    "company": "ToastPro",
    "warranty": "years:2",
    "category": "home appliances",
    "rating": 4.3
  },
  {
    "id": 90,
    "name": "Stand Mixer",
    "price": 1299.99,
    "image": "/images/mixer.jpg",
    "description": "5.5qt bowl, 10 speeds",
    "information": "The MixMaster Elite features a 1000W DC motor that handles thick doughs without overheating. Planetary mixing action ensures complete ingredient incorporation. Includes stainless steel bowl, flat beater, dough hook, and wire whip. Tilt-head design with locking mechanism. Accessory port for attachments like pasta makers or meat grinders.",
    "company": "MixMaster",
    "warranty": "years:4 (motor), years:1 (parts)",
    "category": "home appliances",
    "rating": 4.8
  },
  {
    "id": 91,
    "name": "Slow Cooker",
    "price": 699.99,
    "image": "/images/slowcooker.jpg",
    "description": "6-quart, programmable timer",
    "information": "The SimmerPro Slow Cooker offers 3 cooking modes (Low/High/Warm) with digital countdown timer (up to 20 hours). Stoneware pot is oven-safe up to 200°C and dishwasher safe. Locking lid prevents spills during transport. EvenHeat technology prevents hot spots. Includes recipe book with 50 slow-cooker meals.",
    "company": "SimmerPro",
    "warranty": "years:3",
    "category": "home appliances",
    "rating": 4.5
  },
  {
    "id": 92,
    "name": "Rice Cooker",
    "price": 559.99,
    "image": "/images/ricecooker.jpg",
    "description": "Fuzzy logic, 10-cup capacity",
    "information": "The RicePerfect Cooker uses AI-powered fuzzy logic to adjust cooking time and temperature for perfect rice every time. 11 preset menus for white/brown/sushi rice, porridge, and even cake. Non-stick inner pot with heat-absorbing bottom. Delay timer up to 24 hours. Automatic keep-warm for up to 12 hours without drying out.",
    "company": "RicePerfect",
    "warranty": "years:3",
    "category": "home appliances",
    "rating": 4.4
  },
  {
    "id": 93,
    "name": "Hand Mixer",
    "price": 439.99,
    "image": "/images/handmixer.jpg",
    "description": "5-speed, includes attachments",
    "information": "The QuickMix Hand Mixer features 250W power with Turbo Boost function for tough ingredients. Includes dough hooks, beaters, and whisk attachments. Ergonomic soft-grip handle with finger-tip speed control. Cord storage in base. Easy-release button for quick attachment changes. Lightweight at just 1.2kg.",
    "company": "QuickMix",
    "warranty": "years:2",
    "category": "home appliances",
    "rating": 4.3
  },
  {
    "id": 94,
    "name": "Electric Grill",
    "price": 729.99,
    "image": "/images/grill.jpg",
    "description": "Indoor smokeless grilling",
    "information": "The GrillMaster Indoor uses infrared heating and a drip-free design for smokeless operation. Adjustable temperature up to 230°C. 2000W power sears steaks with perfect grill marks. Removable non-stick plates are dishwasher safe. Includes grease tray and spatula. 15° adjustable tilt for draining fats.",
    "company": "GrillMaster",
    "warranty": "years:2",
    "category": "home appliances",
    "rating": 4.5
  },
  {
    "id": 95,
    "name": "Juicer",
    "price": 689.99,
    "image": "/images/juicer.jpg",
    "description": "Cold press, easy clean",
    "information": "The Juicemax Cold Press operates at 60 RPM to minimize heat and oxidation, preserving nutrients. 150W motor handles hard vegetables like carrots and beets. Includes 1L juice container and pulp container. All removable parts are dishwasher safe. Produces up to 30% more juice than centrifugal models.",
    "company": "Juicemax",
    "warranty": "years:2",
    "category": "home appliances",
    "rating": 4.4
  },
  {
    "id": 96,
    "name": "Dehumidifier",
    "price": 1499.99,
    "image": "/images/dehumidifier.jpg",
    "description": "20L/day, auto shut-off",
    "information": "The DryAir Pro removes up to 20L of moisture daily with intelligent humidity control (30-80% RH). Features a 5L water tank with full-tank alert and continuous drainage option. Washable pre-filter captures large particles. Operates quietly at 38dB. Energy Star certified with 30% less power consumption than standard models.",
    "company": "DryAir",
    "warranty": "years:5 (compressor), years:1 (parts)",
    "category": "home appliances",
    "rating": 4.6
  },
  {
    "id": 97,
    "name": "Air Purifier",
    "price": 1649.99,
    "image": "/images/airpurifier.jpg",
    "description": "HEPA filter, smart sensor",
    "information": "The PureBreeze Smart Purifier features 4-stage filtration: pre-filter, True HEPA, activated carbon, and UV-C light. Covers 50 sqm rooms with CADR of 400 m³/h. Real-time air quality display with auto mode. Works with Alexa for voice control. Filter life indicator. Night mode operates at just 22dB.",
    "company": "PureBreeze",
    "warranty": "years:3",
    "category": "home appliances",
    "rating": 4.5
  },
  {
    "id": 98,
    "name": "Steam Iron",
    "price": 659.99,
    "image": "/images/iron.jpg",
    "description": "1800W, vertical steam",
    "information": "The PressPro Steam Iron delivers 1800W power with 50g/min continuous steam and 200g steam boost. Ceramic soleplate glides smoothly over fabrics. Self-cleaning function prevents mineral buildup. Includes anti-drip system and auto shut-off (30 sec horizontal/8 min vertical). Water tank is easy to fill and detachable.",
    "company": "PressPro",
    "warranty": "years:2",
    "category": "home appliances",
    "rating": 4.3
  },
  {
    "id": 99,
    "name": "Electric Blanket",
    "price": 779.99,
    "image": "/images/blanket.jpg",
    "description": "Queen size, 10 heat settings",
    "information": "The CozyNight Blanket features dual-zone temperature control (each side adjustable independently). Ultra-soft microplush fabric with 10 heating levels. Auto shut-off after 10 hours. Machine washable (controller removed). Low-voltage technology is EMF-reduced. Includes 2m power cord with storage pocket.",
    "company": "CozyNight",
    "warranty": "years:3",
    "category": "home appliances",
    "rating": 4.4
  },
  {
    "id": 100,
    "name": "Humidifier",
    "price": 369.99,
    "image": "/images/humidifier.jpg",
    "description": "Ultrasonic, 4L tank",
    "information": "The MistCare Humidifier uses ultrasonic technology to create a fine, cool mist without white dust. Covers up to 30 sqm for 24 hours on one fill. Adjustable mist output with 360° nozzle. Night light with on/off option. Auto shut-off when empty. Whisper-quiet operation at 28dB. Includes essential oil tray for aromatherapy.",
    "company": "MistCare",
    "warranty": "years:2",
    "category": "home appliances",
    "rating": 4.5
  }
]